Catalogs/Услуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Услуги</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНачисленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлощади</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПотребителяУслуг</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПотребителейУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеНормПотребления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОснованияНормПотребления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаРаспределенияРасчетнойУслуги</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПотребителейУслуг</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВключатьВРаспределение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказаниеПрибораУчетаДляЛьготы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>160</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬУсловиеРасчетаЛьготы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬДополнительнаяУслуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеСортировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПороговыйМетод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПорогов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМашиноМеста</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыМашиноМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйРеквизит</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеРеквизитыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресурсная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасчетаПоСредней</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасчетаПоСредней</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаДляРасчетаПоСредней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСезона</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецСезона</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоВидамТарифа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчитыватьЭнергоемкость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПУХолоднаяВода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПУГарячаяВода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КвоКубов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУслугиПФУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставныеУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыТарифов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Услуги/Forms/КлассификаторУслуг/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
// Процедура обработки ДеревоКлассификатораВыбранПриИзменении.
//
Процедура ВыбранПриИзменении(ТекущиеДанные)
	
	Если ТекущиеДанные.Выбран = 2 Тогда
		ТекущиеДанные.Выбран = 0;
	КонецЕсли;
	
	ОбходДереваВверх(ТекущиеДанные);
	ОбходДереваВниз(ТекущиеДанные);
	
КонецПроцедуры // ВыбранПриИзменении()

&НаСервере
// Процедура обработки результата подбора.
//
Процедура ОбработатьРезультатыПодбораНаСервере()
	
	МассивВыбранныхСтрок = Новый Массив;
	
	Соответствие = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Услуги.Ссылка,
	|	Услуги.Код
	|ИЗ
	|	Справочник.Услуги КАК Услуги";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(Выборка.Код, Выборка.Код);
	КонецЦикла;
	
	МассивВыбранныхСтрокУслугаПодробно = Новый Массив;
	
	СоответствиеУслугаПодробно = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УслугиСДПТПодробно.Ссылка,
	|	УслугиСДПТПодробно.Код
	|ИЗ
	|	Справочник.УслугиСДПТПодробно КАК УслугиСДПТПодробно";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СоответствиеУслугаПодробно.Вставить(Выборка.Код, Выборка.Код);
	КонецЦикла;
	
	
	Дерево = РеквизитФормыВЗначение("ДеревоКлассификатораУслуг");
	Для каждого СтрокаУровень1 Из Дерево.Строки Цикл
		Если СтрокаУровень1.Выбран > 0 Тогда
			
			Если Соответствие.Получить(СтрокаУровень1.Код) = Неопределено Тогда
				МассивВыбранныхСтрок.Добавить(СтрокаУровень1);
			КонецЕсли;
			
			Для каждого СтрокаУровень2 Из СтрокаУровень1.Строки Цикл
				Если СтрокаУровень2.Выбран > 0 Тогда
					Если Соответствие.Получить(СтрокаУровень2.Код) = Неопределено Тогда
						МассивВыбранныхСтрок.Добавить(СтрокаУровень2);
					КонецЕсли;
				КонецЕсли;
				
				Для каждого СтрокаУровень3 Из СтрокаУровень2.Строки Цикл
					Если СтрокаУровень3.Выбран > 0 Тогда
						Если СоответствиеУслугаПодробно.Получить(СтрокаУровень3.Код) = Неопределено Тогда
							МассивВыбранныхСтрокУслугаПодробно.Добавить(СтрокаУровень3);
						КонецЕсли;
					КонецЕсли;
				 КонецЦикла;
				
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	НачатьТранзакцию();
	
	Для каждого СтрокаДерева Из МассивВыбранныхСтрок Цикл
		Если СтрокаДерева.ЭтоГруппа Тогда
			
			СправочникОбъект = Справочники.Услуги.СоздатьГруппу();
			
			СправочникОбъект.Код = СтрокаДерева.Код;
			СправочникОбъект.Наименование = СтрокаДерева.Наименование;
			СправочникОбъект.ПолноеНаименование = СтрокаДерева.ПолноеНаименование;
			
		Иначе
			
			СправочникОбъект = Справочники.Услуги.СоздатьЭлемент();
			
			СправочникОбъект.Код = СтрокаДерева.Код;
			СправочникОбъект.Наименование = СтрокаДерева.Наименование;
			СправочникОбъект.ПолноеНаименование = СтрокаДерева.ПолноеНаименование;
						
			СправочникОбъект.ВидПотребителяУслуг = СтрокаДерева.ВидПотребителяУслуг;
			Если ЗначениеЗаполнено(СтрокаДерева.ИмяВидПлощади) Тогда 
				СправочникОбъект.ВидПлощади = Справочники.ВидыПлощадей[СтрокаДерева.ИмяВидПлощади];
			КонецЕсли;
			СправочникОбъект.СпособНачисления = СтрокаДерева.СпособНачисления;	
			СправочникОбъект.ОснованиеНормПотребления = СтрокаДерева.ОснованиеНормПотребления;	
			Если ЗначениеЗаполнено(СтрокаДерева.ИмяВидУслуги) Тогда 
				СправочникОбъект.ВидУслуги = Справочники.ВидыУслуг[СтрокаДерева.ИмяВидУслуги];	
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаДерева.ЕдиницаИзмеренияКод) Тогда
				ТекЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(СокрЛП(СтрокаДерева.ЕдиницаИзмеренияКод));
				Если ТекЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка() Тогда
					ТекЕдиницаИзмеренияОбъект = Справочники.КлассификаторЕдиницИзмерения.СоздатьЭлемент();
					ТекЕдиницаИзмеренияОбъект.Код = СокрЛП(СтрокаДерева.ЕдиницаИзмеренияКод);
					ТекЕдиницаИзмеренияОбъект.Наименование = СокрЛП(СтрокаДерева.ЕдиницаИзмерения);
					ТекЕдиницаИзмеренияОбъект.Записать();
					ТекЕдиницаИзмерения	= ТекЕдиницаИзмеренияОбъект.Ссылка;					
				КонецЕсли; 
				СправочникОбъект.ЕдиницаИзмерения = ТекЕдиницаИзмерения;	
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаДерева.РодительКод) Тогда
				ТекРодитель = Справочники.Услуги.НайтиПоКоду(СокрЛП(СтрокаДерева.РодительКод));
				СправочникОбъект.Родитель = ТекРодитель;	
			КонецЕсли;
		КонецЕсли;
		
		СправочникОбъект.Записать();
	
	КонецЦикла;
	
	
	Для каждого СтрокаДерева Из МассивВыбранныхСтрокУслугаПодробно Цикл
		
		Если Справочники.УслугиСДПТПодробно.НайтиПоКоду(СокрЛП(СтрокаДерева.Код)) = Справочники.УслугиСДПТПодробно.ПустаяСсылка() Тогда
			
			СправочникОбъект = Справочники.УслугиСДПТПодробно.СоздатьЭлемент();
			
			СправочникОбъект.Код = СокрЛП(СтрокаДерева.Код);
			СправочникОбъект.Наименование = СтрокаДерева.Наименование;
			СправочникОбъект.ПолноеНаименование = СтрокаДерева.ПолноеНаименование;
			
			СправочникОбъект.Записать();
			
		КонецЕсли;
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	
КонецПроцедуры // ОбработатьРезультатыПодбораНаСервере()

&НаКлиенте
// Процедура обхода дерева классификатора вверх.
//
Процедура ОбходДереваВверх(ТекущиеДанные)

	Родитель = ТекущиеДанные.ПолучитьРодителя();
	Если Родитель <> Неопределено Тогда // Верхний уровень
		
		ДочерниеСтроки = Родитель.ПолучитьЭлементы();
		КоличествоВыбранных = 0;
		ОбщееКоличество = 0;
		Для каждого Элемент Из ДочерниеСтроки Цикл
			Если Элемент.Выбран = 2 Тогда
				КоличествоВыбранных = КоличествоВыбранных + 0.5;
			ИначеЕсли Элемент.Выбран = 1 Тогда
				КоличествоВыбранных = КоличествоВыбранных + 1;
			КонецЕсли;
			ОбщееКоличество = ОбщееКоличество + 1;
		КонецЦикла;
		
		Если ОбщееКоличество = КоличествоВыбранных Тогда
			Родитель.Выбран = 1;
		ИначеЕсли КоличествоВыбранных = 0 Тогда
			Родитель.Выбран = 0;
		Иначе
			Родитель.Выбран = 2;
		КонецЕсли;
		
		ОбходДереваВверх(Родитель);
		
	КонецЕсли;
	
КонецПроцедуры // ОбходДереваВверх()

&НаКлиенте
// Процедура обхода дерева классификатора вниз.
//
Процедура ОбходДереваВниз(ТекущиеДанные)
	
	ДочерниеСтроки = ТекущиеДанные.ПолучитьЭлементы();
	Для каждого Элемент Из ДочерниеСтроки Цикл
		Элемент.Выбран = ТекущиеДанные.Выбран;
		ОбходДереваВниз(Элемент);
	КонецЦикла;
	
КонецПроцедуры // ОбходДереваВниз()



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУслугиСДПТПодробно") Тогда
		Макет = Справочники.Услуги.ПолучитьМакет("КлассификаторУслугПодробно");
	Иначе
		Макет = Справочники.Услуги.ПолучитьМакет("КлассификаторУслуг");
	КонецЕсли;
	Макет.Записать(ИмяВременногоФайла);
	Дерево = ЗначениеИзФайла(ИмяВременногоФайла);
	
	Дерево.Колонки.Добавить("Выбран",     Новый ОписаниеТипов("Число"));
	Дерево.Колонки.Добавить("Существует", Новый ОписаниеТипов("Булево"));
	
	Соответствие = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Услуги.Ссылка,
	|	Услуги.Код
	|ИЗ
	|	Справочник.Услуги КАК Услуги";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(Выборка.Код, Выборка.Код);
	КонецЦикла;
	
	СоответствиеУслугаПодробно = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УслугиСДПТПодробно.Ссылка,
	|	УслугиСДПТПодробно.Код
	|ИЗ
	|	Справочник.УслугиСДПТПодробно КАК УслугиСДПТПодробно";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СоответствиеУслугаПодробно.Вставить(Выборка.Код, Выборка.Код);
	КонецЦикла;
	
	Для каждого СтрокаУровень1 Из Дерево.Строки Цикл
		Для каждого СтрокаУровень2 Из СтрокаУровень1.Строки Цикл
			Если Соответствие.Получить(СтрокаУровень2.Код) <> Неопределено Тогда
				СтрокаУровень2.Выбран = 1;
				СтрокаУровень1.Выбран = 1;
			КонецЕсли;
			
			Для каждого СтрокаУровень3 Из СтрокаУровень2.Строки Цикл
				Если СоответствиеУслугаПодробно.Получить(СтрокаУровень3.Код) <> Неопределено Тогда
					СтрокаУровень3.Выбран = 1;
				КонецЕсли;
			КонецЦикла;
				
		КонецЦикла;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоКлассификатораУслуг");
	
КонецПроцедуры // ПриСозданииНаСервере()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
// Процедура вызывается при нажатии кнопки "ОК" командной панели
// табличного поля.
//
Процедура ОК(Команда)
	
	ОбработатьРезультатыПодбораНаСервере();
	Закрыть();
	
КонецПроцедуры // ОК()

&НаКлиенте
// Процедура вызывается при нажатии кнопки "Отмена" командной панели
// табличного поля.
//
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры // Отмена()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ФОРМЫ

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля Выбран списка ДеревоКлассификатора.
//
Процедура ДеревоКлассификатораУслугВыбранПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоКлассификатораУслуг.ТекущиеДанные;
	ВыбранПриИзменении(ТекущиеДанные);
	
КонецПроцедуры // ДеревоКлассификатораУслугВыбранПриИзменении()
